#pragma once
/*	自分のプレイヤー	*/

/*前方宣言*/
//class BasePlayer;

//********************************************************************************************************************
//		自分
//****************************************************************************************************************
class	MyPlayer : public	BasePlayer
{
public:
	//===============================================
	//	初期化と解放
	//===============================================
	MyPlayer();
	~MyPlayer();
	//void Initialize(iex3DObj *obj, iex3DObj *die);
	void Release();


	//===============================================
	//	更新と描画
	//===============================================
	void Update();
	void Render(iexShader *shader = nullptr, char *name = '\0');

	void Mouse_Update();	//	マウスのポジション
	void Control_all();		//　自分だけ操作追加
	void Update_listener();	// リスナー情報更新

	//===============================================
	//	ゲッター,セッター
	//===============================================



};